Repository: zibuyu2015831/LangoTrace
Catalog: Packages/LangoTraceUI/Sources/LangoTraceUI/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, zh_hans

# photoWriting.assist.result.vocab
source: Vocabulary hints
zh_hans: 词汇提示

# photoWriting.assist.sending
source: Asking AI…
zh_hans: 正在请求 AI……

# photoWriting.chip.describeScene
source: Describe the scene
zh_hans: 描述场景

# photoWriting.chip.describeScene.hint
source: What's the setting? What do you see in this moment?
zh_hans: 场景在哪里？照片里有什么？

# photoWriting.chip.recordFeelings
source: Record feelings
zh_hans: 记下感受

# photoWriting.chip.recordFeelings.hint
source: How does this moment make you feel?
zh_hans: 这一刻让你感受到什么？

# photoWriting.createEntry
source: Create Entry
zh_hans: 生成记录

# photoWriting.draft.placeholder
source: Write about this photo…
zh_hans: 写下你对这张照片的想法……

# photoWriting.localPreview.notice
source: Local preview only. The final feature will request photo and provider confirmation before using external services.
zh_hans: 仅本地预览。正式能力会在使用照片或外部 Provider 前请求确认。

# photoWriting.mockPhoto.accessibilityLabel
source: Mock photo preview, breakfast by a sunny window
zh_hans: 模拟照片预览，阳光窗边的早餐

# photoWriting.mockPhoto.caption
source: Window breakfast
zh_hans: 窗边早餐

# photoWriting.nativeDraft.body
source: I had breakfast by the window this morning. Sunlight was on the table, and I suddenly felt like I could start the day slowly.
zh_hans: 早上在窗边吃早餐，阳光照在桌子上。我突然觉得今天可以慢一点开始。

# photoWriting.nativeDraft.title
source: Native Draft
zh_hans: 母语草稿

# photoWriting.photo.accessibilityLabel
source: Selected photo
zh_hans: 已选照片

# photoWriting.photo.addPrompt
source: Tap to select a photo
zh_hans: 点击选择照片

# photoWriting.preview.summary
source: This is a local mock preview for design review. It shows the future photo-writing flow without opening Photos, using AI, or sending data.
zh_hans: 这是用于设计评审的本地模拟预览。它展示未来照片写作流程，不打开照片、不调用 AI，也不发送数据。

# photoWriting.preview.title
source: Turn this moment into a sentence
zh_hans: 把这个瞬间变成一句话

# photoWriting.startWithPhoto
source: Start with a Photo
zh_hans: 用照片开始

# photoWriting.targetExample.title
source: %@ Example
zh_hans: %@ 示例

# photoWriting.topic.body
source: Write about a slow morning by the window: the light on the table, breakfast, and the feeling of starting the day gently.
zh_hans: 写一个窗边慢早餐：桌上的光、早餐的细节，以及今天想慢一点开始的感觉。

# photoWriting.topic.title
source: Suggested angle
zh_hans: 建议角度

# practice.action.markComplete
source: Mark Complete
zh_hans: 标记完成

# practice.backtranslation.guidance.summary
source: This sentence has no learning material yet. Open the entry to generate it, then come back to back-translate.
zh_hans: 这句话还没有学习材料。请到记录详情生成后再回来回译。

# practice.backtranslation.guidance.title
source: Generate learning material first
zh_hans: 先生成学习材料

# practice.backtranslation.hint
source: There's more than one good version — close in meaning is enough.
zh_hans: 参考表达不止一种，意思贴近即可。

# practice.backtranslation.input.placeholder
source: Write your target-language version
zh_hans: 写下你的目标语言表达

# practice.backtranslation.keyPoints
source: Key points
zh_hans: 重点

# practice.backtranslation.literalTranslation
source: Literal
zh_hans: 直译

# practice.backtranslation.naturalTranslation
source: Natural expression
zh_hans: 自然表达

# practice.backtranslation.notes
source: Notes
zh_hans: 说明

# practice.backtranslation.prompt
source: Native meaning
zh_hans: 中文原意

# practice.backtranslation.reference
source: Reference
zh_hans: 参考表达

# practice.backtranslation.retry
source: Write again
zh_hans: 再写一次

# practice.backtranslation.reveal
source: Reveal reference
zh_hans: 对照参考

# practice.backtranslation.review.button
source: Ask AI to review
zh_hans: 请 AI 点评

# practice.backtranslation.review.cancel
source: Cancel
zh_hans: 取消

# practice.backtranslation.review.failed.authentication
source: Check your API credential.
zh_hans: 请检查 API 凭证。

# practice.backtranslation.review.failed.invalidResponse
source: The response could not be read. Try again.
zh_hans: 响应无法解析，请重试。

# practice.backtranslation.review.failed.network
source: Network problem. Try again.
zh_hans: 网络异常，请重试。

# practice.backtranslation.review.failed.providerNotConfigured
source: Set up an AI provider in settings first.
zh_hans: 请先在设置中配置 AI Provider。

# practice.backtranslation.review.failed.providerRejected
source: The provider declined the request. Try again later.
zh_hans: 服务方拒绝了本次请求，请稍后再试。

# practice.backtranslation.review.failed.timeout
source: The request timed out. Try again.
zh_hans: 请求超时，请重试。

# practice.backtranslation.review.failed.title
source: Review didn’t run
zh_hans: 点评未完成

# practice.backtranslation.review.failed.unsupported
source: This provider or model is not supported yet.
zh_hans: 当前服务方或模型暂不支持。

# practice.backtranslation.review.footnote
source: An AI review sends your answer, the meaning to translate, and the reference to your configured AI provider — only when you tap below.
zh_hans: 点评会把你的作答、待翻译的母语原意和参考表达发送给你已配置的 AI Provider，仅在你点击下方按钮时发送。

# practice.backtranslation.review.observations
source: Observations
zh_hans: 观察

# practice.backtranslation.review.registerNote
source: Register
zh_hans: 语体

# practice.backtranslation.review.sending
source: Reviewing…
zh_hans: 点评中…

# practice.backtranslation.review.suggestions
source: Suggestions
zh_hans: 建议

# practice.backtranslation.yourAnswer
source: Your expression
zh_hans: 你的表达

# practice.continue.accessibilityLabel
source: Continue practice for %@
zh_hans: 继续练习%@

# practice.continue.title
source: Continue Listening
zh_hans: 继续听 / 跟读

# practice.dictation.differenceSummary
source: %lld differences · Local comparison, not sent to AI
zh_hans: %lld 处差异 · 本机对照，不发送 AI

# practice.dictation.input.placeholder
source: Type what you heard
zh_hans: 写下你听到的句子

# practice.dictation.listen
source: Replay
zh_hans: 重听

# practice.dictation.listenCount
source: Listened %lld times
zh_hans: 已听 %lld 次

# practice.dictation.reference
source: Reference
zh_hans: 参考句

# practice.dictation.retry
source: Try again
zh_hans: 再试一次

# practice.dictation.submit
source: Compare
zh_hans: 提交对照

# practice.dictation.yourAnswer
source: Your dictation
zh_hans: 你的听写

# practice.empty.summary
source: Create learning material for an entry before starting practice.
zh_hans: 先为一条记录生成学习材料，再开始练习。

# practice.failure.attemptSaveFailed
source: Couldn't save this attempt. The comparison is still shown; try submitting again.
zh_hans: 未能保存本次作答。对照结果仍在，请重试提交。

# practice.failure.audioBusy
source: Finish the current recording or playback before starting another audio action.
zh_hans: 请先结束当前录音或播放，再开始新的音频操作。

# practice.failure.inputTooLong
source: Your answer is too long to compare. Shorten it and try again.
zh_hans: 作答过长，无法对照。请缩短后重试。

# practice.failure.missingReadyRecording
source: Record one complete attempt before reviewing or completing this sentence.
zh_hans: 请先完成一次录音，再回放或标记本句完成。

# practice.failure.missingSession
source: This sentence practice session could not be restored.
zh_hans: 无法恢复这条句子的练习会话。

# practice.failure.playbackUnavailable
source: This recording cannot be played right now. The completion record is still kept.
zh_hans: 当前无法播放这段录音，本次完成记录仍会保留。

# practice.failure.recordingUnavailable
source: This recording could not be saved for playback. Try recording the sentence again.
zh_hans: 这次录音未能保存为可回放音频，请重新录制本句。

# practice.failure.title
source: Practice needs attention
zh_hans: 练习需要处理

# practice.failure.unavailable
source: Practice actions are not available in this environment.
zh_hans: 当前环境不可使用练习操作。

# practice.listen.hint
source: Toggles local playback feedback for this sentence.
zh_hans: 切换这句话的本地播放反馈。

# practice.modes.backtranslation
source: Back translation
zh_hans: 回译

# practice.modes.dictation
source: Dictation
zh_hans: 听写

# practice.modes.shadowing
source: Shadowing
zh_hans: 跟读

# practice.navigation.next
source: Next
zh_hans: 下一句

# practice.navigation.next.hint
source: Switch to the next sentence in this entry.
zh_hans: 切换到这篇记录的下一句。

# practice.navigation.position
source: Sentence %1$d of %2$d
zh_hans: 第 %1$d / %2$d 句

# practice.navigation.previous
source: Previous
zh_hans: 上一句

# practice.navigation.previous.hint
source: Switch to the previous sentence in this entry.
zh_hans: 切换到这篇记录的上一句。

# practice.noContent.summary
source: This entry needs learning material before practice can start.
zh_hans: 这条记录需要先生成学习材料才能练习。

# practice.noContent.title
source: No Practice Content
zh_hans: 没有练习内容

# practice.prompt.explanation.collapse
source: Hide notes
zh_hans: 收起讲解

# practice.prompt.explanation.expand
source: Show notes
zh_hans: 查看讲解

# practice.prompt.explanation.toggle.hint
source: Show or hide the sentence notes.
zh_hans: 展开或收起词句讲解。

# practice.prompt.translation.collapse
source: Hide translation
zh_hans: 收起释义

# practice.prompt.translation.expand
source: Show translation
zh_hans: 查看释义

# practice.prompt.translation.title
source: Translation
zh_hans: 中文释义

# practice.prompt.translation.toggle.hint
source: Show or hide the full translation.
zh_hans: 查看或收起中文释义。

# practice.recording.completedLocal
source: Completed recording saved locally.
zh_hans: 已完成的录音保存在本机。

# practice.recording.guidance
source: Record one attempt, review it, then mark this sentence complete.
zh_hans: 录下一次跟读，回听后再标记本句完成。

# practice.recording.inProgress
source: Recording in progress...
zh_hans: 正在录音...

# practice.recording.playback
source: Review Recording
zh_hans: 回放录音

# practice.recording.playing
source: Playing Recording
zh_hans: 正在回放

# practice.recording.recordAgain
source: Record Again
zh_hans: 再录一次

# practice.recording.start
source: Start Recording
zh_hans: 开始录音

# practice.recording.stop
source: Stop Recording
zh_hans: 停止录音

# practice.sentenceList.continueFrom
source: Continue from sentence %lld
zh_hans: 从第 %lld 句继续

# practice.sentenceList.modePicker
source: Practice mode
zh_hans: 练习方式

# practice.sentenceList.practiced
source: Practiced
zh_hans: 已练

# practice.shadowing.title
source: Shadowing
zh_hans: 跟读练习

# practice.sourceBoundary
source: Source: %@. This session stays on this device.
zh_hans: 来源：%@。本次练习保留在本机。

# practiceStep.compare
source: Compare
zh_hans: 对照

# practiceStep.compare.body
source: Compare your recall with the target-language version and mark the phrases to review.
zh_hans: 对照回忆内容和目标语言版本，标出需要复习的词句。

# practiceStep.completed
source: Completed
zh_hans: 已完成

# practiceStep.completed.body
source: This practice session is complete. Review the phrases you want to keep.
zh_hans: 本次练习已完成。你可以复习想保留的词句。

# practiceStep.prepare
source: Prepare
zh_hans: 准备

# practiceStep.prepare.body
source: Read the source entry and target-language version before starting.
zh_hans: 先阅读生活记录和目标语言版本，再开始练习。

# practiceStep.prepareMaterial
source: Prepare Material
zh_hans: 准备材料

# practiceStep.record
source: Record
zh_hans: 录音

# practiceStep.shadow
source: Shadow
zh_hans: 跟读

# reading.action.explain
source: Explain
zh_hans: 解释

# reading.action.grammar
source: Grammar
zh_hans: 语法分析

# reading.action.more
source: More
zh_hans: 更多

# reading.action.translate
source: Translate
zh_hans: 翻译

# reading.audio.failed
source: Failed
zh_hans: 失败

# reading.document.edit
source: Edit Document
zh_hans: 编辑文档

# reading.editor.error.emptyBody
source: Text can't be empty.
zh_hans: 正文不能为空。

# reading.editor.error.generic
source: Save failed. Try again.
zh_hans: 保存失败，请重试。

# reading.explanation.contains.explained.sentence
source: Contains an explained sentence · View
zh_hans: 该选区包含已解析句子 · 查看

# reading.explanation.mode.bilingualBridge
source: Bilingual
zh_hans: 双语

# reading.explanation.mode.picker.label
source: Explanation Language Mode
zh_hans: 解释语言模式

# reading.explanation.mode.sourceLanguage
source: Native
zh_hans: 母语

# reading.explanation.mode.targetImmersion
source: Immersion
zh_hans: 沉浸

# reading.explanation.regenerate
source: Regenerate
zh_hans: 重新生成

# reading.explanation.source.cached
source: Cached
zh_hans: 已缓存

# reading.import.title.placeholder
source: Title
zh_hans: 标题

# reading.inspector.body
source: Select text to explain it, or choose a sentence to play audio.
zh_hans: 选择文本进行解释，或选择句子播放音频。

# reading.inspector.expand
source: Show Inspector
zh_hans: 展开解释面板

# reading.inspector.fold
source: Hide Inspector
zh_hans: 收起解释面板

# reading.inspector.title
source: Selection
zh_hans: 选中文本

# reading.library.collection.assign
source: Assign Collection
zh_hans: 加入分组

# reading.library.collection.filter
source: Collection
zh_hans: 分组

# reading.library.collection.placeholder
source: Collection
zh_hans: 分组

# reading.library.delete
source: Delete
zh_hans: 删除

# reading.library.deleted
source: Deleted
zh_hans: 已删除

# reading.library.empty.body
source: Paste a short text or Markdown document to start reading.
zh_hans: 粘贴短文本或 Markdown 文档开始阅读。

# reading.library.empty.title
source: No reading documents
zh_hans: 暂无阅读资料

# reading.library.favorite.toggle
source: Favorite
zh_hans: 收藏

# reading.library.filter.all
source: All
zh_hans: 全部

# reading.library.filter.favorites
source: Favorites
zh_hans: 收藏

# reading.library.import.file
source: Import File
zh_hans: 导入文件

# reading.library.import.paste
source: Paste Text
zh_hans: 粘贴文本

# reading.library.restore
source: Restore
zh_hans: 恢复

# reading.library.search.placeholder
source: Search reading library
zh_hans: 搜索阅读资料

# reading.library.subtitle
source: Local reading documents for the current language space.
zh_hans: 当前语言空间的本地阅读资料。

# reading.library.tag.assign
source: Add Tag
zh_hans: 添加标签

# reading.library.tag.filter
source: Tag
zh_hans: 标签

# reading.library.tag.placeholder
source: Tag
zh_hans: 标签

# reading.panel.explanation.title
source: AI Explanation
zh_hans: AI 解释

# reading.panel.failed
source: Explanation failed. Try again.
zh_hans: 解释失败，请重试。

# reading.panel.idle
source: Choose Explain or Listen for this selection.
zh_hans: 可对当前选中内容执行解释或听。

# reading.panel.loading
source: Loading explanation…
zh_hans: 正在生成解释…

# reading.progress.completed
source: Completed
zh_hans: 已读完

# reading.result.example
source: Example
zh_hans: 例句

# reading.result.grammar
source: Grammar
zh_hans: 语法

# reading.result.translation
source: Translation
zh_hans: 释义

# reading.result.usage
source: Usage
zh_hans: 用法

# reading.selection.context.adjacentParagraphs
source: Sending adjacent paragraphs
zh_hans: 发送相邻段落

# reading.selection.context.currentParagraph
source: Sending current paragraph
zh_hans: 发送当前段落

# reading.selection.context.fullDocument
source: Sending full document
zh_hans: 发送全文

# reading.selection.scope.fragment
source: Selected fragment
zh_hans: 选中片段

# reading.selection.scope.sentence
source: Selected sentence
zh_hans: 选中句子

# reading.source.htmlClip
source: Web Clip
zh_hans: 网页剪藏

# reading.source.pastedText
source: Pasted Text
zh_hans: 粘贴文本

# reading.source.plainText
source: Plain Text
zh_hans: 纯文本

# reading.source.webArticle
source: Web Article
zh_hans: 网页文章

# requestPreview.content.backtranslationReferenceSentence
source: Reference sentence
zh_hans: 参考表达

# requestPreview.content.companionConversation
source: This conversation (sent to extract vocabulary / expressions)
zh_hans: 本段对话（发送以提取词汇 / 表达）

# requestPreview.content.broughtInRecords
source: One of your saved records (as a topic)
zh_hans: 你保存的 1 条记录（作为话题）

# requestPreview.content.curatedLearnerMemory
source: A few of your saved life facts (selected and scrubbed)
zh_hans: 你保存的少量生活事实（已挑选并脱敏）

# requestPreview.content.currentEntryBody
source: Current entry text
zh_hans: 当前记录正文

# requestPreview.content.currentLearningText
source: Current learning text
zh_hans: 当前学习正文

# requestPreview.content.nativeLanguageProfile
source: Your native language
zh_hans: 母语设置

# requestPreview.content.practiceAttempt
source: Your answer
zh_hans: 你的作答

# requestPreview.content.proficiencyLevel
source: Proficiency level
zh_hans: 水平自评

# requestPreview.content.readingContextWindow
source: Surrounding context
zh_hans: 上下文窗口

# requestPreview.content.selectedReadingPassage
source: Selected passage
zh_hans: 选中的阅读片段

# requestPreview.content.targetLanguageProfile
source: Target language
zh_hans: 目标语言

# requestPreview.external.body
source: Will send after confirmation: %@, selected text snippets, and the selected writing style %@.
zh_hans: 确认后将发送：%@、选中的正文片段和所选表达风格 %@。

# requestPreview.field.length
source: Approximate size
zh_hans: 大致长度

# requestPreview.field.model
source: Model
zh_hans: 模型

# requestPreview.field.provider
source: Service
zh_hans: 服务方

# requestPreview.includes.header
source: Will send
zh_hans: 将发送

# requestPreview.length.long
source: Long
zh_hans: 较长

# requestPreview.length.medium
source: Medium
zh_hans: 中等

# requestPreview.length.short
source: Short
zh_hans: 较短

# requestPreview.localMock
source: Local draft
zh_hans: 本地草稿

# requestPreview.localMock.body
source: When online generation is enabled, LangoTrace will ask for confirmation before sending %@, selected text snippets, and the selected writing style %@.
zh_hans: 启用在线生成时，语迹会先请求确认，再发送 %@、选中的正文片段和所选表达风格 %@。

# requestPreview.notSent.audioRecordings
source: Your voice recordings
zh_hans: 你的录音

# requestPreview.notSent.longTermMemory
source: Your full long-term memory store
zh_hans: 你的完整长期记忆库

# requestPreview.notSent.photoAttachments
source: Your photos
zh_hans: 你的照片

# requestPreview.notSent
source: Not sent: unrelated history, full photo access, credentials, or unselected content.
zh_hans: 不会发送：无关历史记录、完整照片访问权限、凭证或未选中的内容。

# requestPreview.promptFallback
source: Generation intent
zh_hans: 生成意图

# requestPreview.realtime.offline
source: Online generation is off, so nothing will be sent.
zh_hans: 在线生成未开启，不会发送任何内容。

# search.group.entry
source: Records
zh_hans: 记录

# search.group.memory
source: Memory
zh_hans: 记忆

# search.group.reading
source: Reading
zh_hans: 阅读

# search.placeholder
source: Search your records, reading, and memory
zh_hans: 搜索记录、阅读与记忆

# search.scope.currentSpace
source: Scope: current language space
zh_hans: 范围：当前语言空间

# search.zeroState
source: No matches in this language space.
zh_hans: 当前语言空间没有匹配结果。

# settings.aiProvider.detail
source: Provider credentials should be stored securely. Life content is sent only after the user explicitly starts an online generation action.
zh_hans: Provider 凭证应安全保存。生活内容只有在用户明确发起在线生成时才会发送。

# settings.aiProvider.nextRequirement
source: Add secure credential storage, request preview, provider health checks, and request logs before enabling external generation.
zh_hans: 启用外部生成前，需要补齐安全凭证存储、请求预览、Provider 健康检查和请求日志。

# settings.aiProvider.summary
source: Generation stays on this device until you add a provider.
zh_hans: 添加 Provider 前，生成流程保留在本机。

# settings.appearance.dark
source: Dark
zh_hans: 深色

# settings.appearance.detail
source: Appearance only changes the interface on this device. It does not change language spaces, learning content, Provider configuration, or sync scope.
zh_hans: 外观只影响这台设备上的界面显示，不改变语言空间、学习内容、Provider 配置或同步范围。

# settings.appearance.light
source: Light
zh_hans: 浅色

# settings.appearance.nextRequirement
source: Future theme work can add brand palettes, typography, or interaction profiles behind a separate theme registry. This setting only controls system light and dark appearance.
zh_hans: 后续主题能力可以在独立主题注册表中扩展品牌色、字体或交互样式；当前设置只控制系统浅色与深色外观。

# settings.appearance.selectionFootnote
source: Only changes this device's interface. Language spaces and saved content stay unchanged.
zh_hans: 仅影响这台设备的界面，不改变语言空间或已保存内容。

# settings.appearance.summary
source: Choose whether LangoTrace follows the system appearance, uses Light, or uses Dark.
zh_hans: 选择语迹使用系统外观、浅色或深色。

# settings.appearance.system
source: System
zh_hans: 跟随系统

# settings.appearance.title
source: Appearance
zh_hans: 外观

# settings.detail.noSideEffects.body
source: Opening this page does not request permissions, send content, or change stored data.
zh_hans: 打开本页不会申请权限、发送内容或改变已保存数据。

# settings.globalDeviceContext
source: This device
zh_hans: 当前设备

# settings.importExport.detail
source: Import and export should cover life entries, learning material, attachments, and privacy-safe metadata after the local library model is stable. This page does not open file panels, read import files, or write export packages.
zh_hans: 本地资料库模型稳定后，导入导出应覆盖生活记录、学习材料、附件和隐私安全的元数据；当前不会打开文件面板、读取导入文件或写入导出包。

# settings.importExport.nextRequirement
source: Finalize the local library model, attachment handling, file access rules, and Markdown, JSON, and attachment import/export formats.
zh_hans: 完成本地资料库模型、附件处理、文件访问规则，以及 Markdown、JSON 和附件导入导出格式设计。

# settings.importExport.summary
source: Import and export will be designed around the local library and attachments after the data model is stable.
zh_hans: 数据模型稳定后，导入导出将围绕本地资料库和附件目录设计。

# settings.importExport.title
source: Import / Export
zh_hans: 导入导出

# settings.interfaceLanguage.summary
source: Follows the system by default and falls back to English when needed.
zh_hans: 默认跟随系统，必要时回退英文。

# settings.languageSpace.detail
source: Language spaces define the source language, target language, level, and learning context used by the app.
zh_hans: 语言空间定义应用使用的母语、目标语言、水平和学习上下文。

# settings.languageSpace.management.add
source: Add Space
zh_hans: 新增空间

# settings.languageSpace.management.allSection
source: All Language Spaces
zh_hans: 所有语言空间

# settings.languageSpace.management.currentBadge
source: Current
zh_hans: 当前

# settings.languageSpace.management.currentSection
source: Current Space
zh_hans: 当前空间

# settings.languageSpace.management.delete
source: Delete
zh_hans: 删除

# settings.languageSpace.management.deleteCurrentFallbackMessage
source: This space will be removed from the active list. LangoTrace will switch to your most recently used remaining space.
zh_hans: 该空间会从当前列表移除。语迹会切换到最近使用的其他空间。

# settings.languageSpace.management.deleteLastSpaceMessage
source: This space will be removed from the active list. This version has no restore entry, and you will return to the language-space creation flow.
zh_hans: 该空间会从当前列表移除。当前版本没有恢复入口，删除后会回到创建语言空间流程。

# settings.languageSpace.management.deleteMessage
source: This space will be removed from the active list. This version has no restore entry.
zh_hans: 该空间会从当前列表移除。当前版本没有恢复入口。

# settings.languageSpace.management.deleteTitle
source: Delete Language Space?
zh_hans: 删除语言空间？

# settings.languageSpace.management.duplicateNameWarning
source: A space with this name already exists. You can still save it.
zh_hans: 已有同名空间，仍可继续保存。

# settings.languageSpace.management.edit
source: Edit
zh_hans: 编辑

# settings.languageSpace.management.editTitle
source: Edit Space
zh_hans: 编辑空间

# settings.languageSpace.management.explanationLanguageAdaptsToLevel
source: Explanation language adapts automatically to your level.
zh_hans: 解释语言会随学习等级自动调整。

# settings.languageSpace.management.name
source: Space Name
zh_hans: 空间名称

# settings.languageSpace.management.noSpacesBody
source: Create a language space to start saving your learning context locally.
zh_hans: 创建语言空间后，语迹会在本地保存你的学习上下文。

# settings.languageSpace.management.noSpacesTitle
source: No Language Spaces
zh_hans: 暂无语言空间

# settings.languageSpace.management.selectSpacePrompt
source: Select a language space.
zh_hans: 请选择一个语言空间。

# settings.languageSpace.management.title
source: Language Spaces
zh_hans: 语言空间

# settings.languageSpace.summary
source: The current space keeps your language direction, level, and learning context.
zh_hans: 当前空间保存语言方向、水平和学习上下文。

# settings.learnerProfile.summary
source: See what the App knows about you
zh_hans: 查看 App 对你的了解

# settings.localData.detail
source: Local data should cover life entries, learning material, attachments, search, memory, and export boundaries.
zh_hans: 本地数据应覆盖生活记录、学习材料、附件、搜索、记忆和导出边界。

# settings.localData.nextRequirement
source: Add the local library, migrations, attachment storage, and export boundaries.
zh_hans: 补齐本地资料库、迁移、附件存储和导出边界。

# settings.localData.summary
source: Life entries and learning material stay on this device.
zh_hans: 生活记录和学习材料保留在本机。
